// Задача 1: Напишите программу, которая принимает
// на вход число и проверяет, кратно ли оно
// одновременно 7 и 23

// Console.WriteLine("Введите число :");
// int num1 = Convert.ToInt32(Console.ReadLine());

//     if ( num1 % 7 == 0 && num1 % 23 == 0)
//     {
//         System.Console.WriteLine($"{num1} -> yes");
//     }

// else
// {
//             System.Console.WriteLine($"{num1} -> no");
// }

// Задача 2: Напишите программу, которая принимает
// на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠
// 0 и выдаёт номер координатной четверти плоскости,
// в которой находится эта точка.

// Console.WriteLine("Введите точку кордината X :");
// int x = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите точку кордината Y :");
// int y = Convert.ToInt32(Console.ReadLine());



// if (x > 0 && y > 0)
// {
//     Console.WriteLine($"{x},{y} -> 1");
// }

// else if (x < 0 && y > 0)
// {
//     Console.WriteLine($"{x},{y} -> 2");
// }

// else if (x < 0 && y < 0)
// {
//     Console.WriteLine($"{x},{y} -> 3");
// }

// else if (x > 0 && y < 0)
// {
//     Console.WriteLine($"{x},{y} -> 4");
// }

// else
// {
//     Console.WriteLine("Точка находится на оси координат");
// }

// Задача 3: Напишите программу, которая принимает
// на вход целое число из отрезка [10, 99] и показывает
// наибольшую цифру числа.

// Console.WriteLine("Введите целое число в перемежутке (10,99):");
// int num = Convert.ToInt32(Console.ReadLine());


//     if (num >9 && num < 100)
// {
//     int ed = num % 10;
//     int dec = num / 10;
//     if ( ed > dec)
//     {
//         Console.WriteLine($"{num} -> {ed}");
//     }
//     else 
//     {
//         Console.WriteLine($"{num} -> {dec}");
//     }

// }
//     else 
//     {
//         Console.WriteLine("Вы не ввели целое число в перемежутке (10,99):");
//     }

// Задача 4: Напишите программу, которая на вход
// принимает натуральное число N, а на выходе
// показывает его цифры через запятую

// НЕ СМОГ САМОСТОЯТЕЛЬНО РЕШИТЬ
