// Задача 1: Напишите программу, которая принимает
// на вход число и проверяет, кратно ли оно
// одновременно 7 и 23

// Console.WriteLine("Введите число :");
// int num1 = Convert.ToInt32(Console.ReadLine());

//     if ( num1 % 7 == 0 && num1 % 23 == 0)
//     {
//         System.Console.WriteLine($"{num1} -> yes");
//     }

// else
// {
//             System.Console.WriteLine($"{num1} -> no");
// }




